protected/tests/ab_n_1000_c_200.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.11 (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        192.168.1.11
Server Port:            80

Document Path:          /team/index.php?r=paper/index
Document Length:        10777 bytes

Concurrency Level:      200
Time taken for tests:   17.908 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      11164000 bytes
HTML transferred:       10777000 bytes
Requests per second:    55.84 [#/sec] (mean)
Time per request:       3581.627 [ms] (mean)
Time per request:       17.908 [ms] (mean, across all concurrent requests)
Transfer rate:          608.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   19 147.2      2    3004
Processing:   130 2918 3016.0   1910   17900
Waiting:      125 2494 2771.5   1698   11124
Total:        135 2937 3036.4   1913   17906

Percentage of the requests served within a certain time (ms)
  50%   1913
  66%   2494
  75%   2924
  80%   3279
  90%   8947
  95%  10809
  98%  11068
  99%  11102
 100%  17906 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.11 (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        192.168.1.11
Server Port:            80

Document Path:          /team/index.php?r=paper/index
Document Length:        10777 bytes

Concurrency Level:      200
Time taken for tests:   17.680 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      11164000 bytes
HTML transferred:       10777000 bytes
Requests per second:    56.56 [#/sec] (mean)
Time per request:       3536.096 [ms] (mean)
Time per request:       17.680 [ms] (mean, across all concurrent requests)
Transfer rate:          616.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  119 564.6      2    7010
Processing:    92 3250 1626.3   3242   11898
Waiting:       85 3039 1545.8   2971   11575
Total:         98 3369 1766.5   3280   11906

Percentage of the requests served within a certain time (ms)
  50%   3280
  66%   3638
  75%   3807
  80%   3983
  90%   4544
  95%   6137
  98%  10609
  99%  11149
 100%  11906 (longest request)